{
    "Cities": {
        "Errachidia-Midelt-Merzouga": "Midelt, Errachidia and Merzouga lead the east side of Morocco. The first two cities show a mountainous country with the reliefs of the Middle Atlas Mountains that draw perfect nature. This majestic setting seduces and charms its visitors. It is also from there that the caravans used to leave, loaded with food, for Timbuktu, and returning back. Merzouga is one of the gates of the Sahara which is a small magnetic village located in the middle of the sands. It’s the territory of the Erg Chebbi, a world of dunes, palm groves, tracks and hikes. Roam through the desert and explore these expansive sand bathed in sunshine and a magic atmosphere. You walk in the middle of these arid vastness when, at the bend of a dune, and you see a lake : you’ve just arrived to Dayet Srij. Stilts are characterizing its waters, above which are flying doves and wagtails, and storks are hovering. In the middle of the desert is established a wide variety of ecosystems, the richest of Morocco. The Moroccan east is full of curiosities. Get immersed in the mountains and deserts and say hello to a completely different country !",
        "Chefchaouen, the charming bride": "Built on a mountainside, Chefchaouen is a city with a special vibes. It unique charm gives an impression of unreality. With its blue-rinsed houses, the whole city seems to be bathed in azure. You walk around as if you were in a dream. More than just an ornament, the beautiful Chefchaouen brims with attractions. Its heritage is rich. The inescapable Medina with its famous narrow winding alleys, is an opportunity to mingle with the local population, and to smell and taste delights: from freshly baked bread, to skillfully prepared tagines. There is also the Kasbah which stands in the middle of the old quarter: its lush gardens, located in the center of the city, are a haven of freshness. Its museum which is home to a collection of old weapons, some photos of the city, and textiles, is a must-see. Boasting its unique geographical position, Chefchaouen is a paradise for walkers. The paths of the surrounding mountains offer pleasant hiking activities. You’ll explore a new side of Morocco, that of the Rif mountain range, as you stroll them. Make the most of your stay in the picture perfect Blue city !",
        "Taroudant": "Taroudant with its majestic ramparts, is one of the most beautiful towns in Morocco. Stroll in the shade of its walls full of history and whose towers have stood for more than five centuries to protect the ancient capital from the Saadian sultans. All day long, the sun strikes these high stone columns and bathes the city in a light where the gold of its rays blends well with the ochre of the walls. City of deep-rooted and long-standing history, Taroudant has a lot of stories to tell. Here, the dynamic of modern life blend seamlessly with the traditional heritage. Venture into the middle of its active souks alleys, negotiate with the merchants  on the stalls, and discover all the richness of local craftsmanship. Leather is particularly famous, as well as terracotta trinkets and Amazigh jewellery. Taroudant has also made a specialty, argan oil. If you want to meet specialists of this delight, go outside the ramparts, and visit cooperatives and private individuals who shell the nuts, press them, extract the substantial marrow, and then make whole oils ready to taste. In addition to all of these assets, Taroudant is the starting point of many hikes. Located in the center of the two Atlas mountains, it benefits from an advantageous position where hikers and backpackers come in droves. Nature and culture, modernity and tradition, Taroudant is definitely not lacking of attractions. Roam through its streets, criss-cross its surroundings and paint your stay with the colors of Morocco.",
        "Azilal": "Extend your stay in Morocco and visit the attractive town, Azilal. Located in the center of the Atlas Mountains, this city is teeming with charming landscapes. Its unique vivid culture, crafts and architecture, has contributed to develop a responsible and supportive ecotourism that attracts more and more tourists. Come and enjoy a rich and varied gastronomy : from Amazigh couscous, to fish tagine, to olive tagine with argan oil. You’ll be seduced by the many natural wonders in front of you ! Contemplate the splendid waterfalls of Ouzoud, and let yourself be surprised by the amazing natural bridge of Imi N'Ifri, near Demnate. Admire the azure blue water of the lake of Bin El Widane, and refresh yourself in the gorges of the Ahansal wadi or to take a walk in the very beautiful natural reserve of Tamga. Last stopover, the Aït Bouguemez valley that bears well its nickname « valley of happy people ». Surrounded by the majestic M'goun mountain, the valley culminates at more than 4,071 meters. Meet the local inhabitants over a traditional mint tea and succulent Moroccan pastries. ",
        "Ifrane": "With its clean air, scrubbed streets, red-roofed houses, white winters, and being set high up in Atlas mountains, Ifrane is a go-to destination ! Set at an altitude of 1,650 metres, Ifrane charms never ceases to amaze its visitors with its calm waves of its lakes, and the waterfalls pouring cold waters into the valleys. It is beautifully surrounded by the largest cedar forest in the world, with its picturesque green trees on the Middle Atlas Mountains slopes. Its picturesque lake studded-parks gives its visitors a taste of an unexpected atmosphere, where its enjoyable to stroll. A rich and varied fauna decorate the most beautiful hiking trails. Diverse bird and monkey species inhabit its park : A Barbary macaque will amuse you, while you’ll get to see also the Barbary deer watching you a few meters away. Ifrane is also a heritage. You’ll come to the cleanest streets in the world, and discover a typical regional craft. You’ll come across upholsterers working on their carpets, and mat makers weaving rush stems, and a pottery or Thuya wood shop where you’ll find charming knick-knacks. From a luxury hotel to a charming red-roofed house, this year-round destination promises you the sun and the moon !",
        "Ouarzazate-Zagora-Tinghir": "Setting out for Ouarzazate, Zagora, Tinghir is going for an extraordinary journey brimming with a breathtaking wonders. The region reveals to its visitors a diversity of incredible landscapes, from the singular atmosphere of the desert to the picturesque green valleys. It’s not a surprise that David Lean, Ridley Scot, Martin Scorsese or Alejandro González Iñárritu, have chosen this destination, just like their forefathers did who became famous for filming the record-breaking \"Lawrence of Arabia\", \"Gladiator\", \"Kundun\", \"Babel\" and mots recently « Prison Break ». Thrill seekers who eager for adventure and trekking, will find many tracks to take you to the edge of the desert. Meet camel drivers and their caravans at the crossroads of the roads of Draâ, Ziz and Dades, How about a night under a bivouac ? The dune of Tinfou, near Zagora, also called \"dune of the golden sand\", will give you an unforgettable experience ! Upon arrival on Tinghir, your journe begins from the Glaoui Kasbah where you’ll admire the splendid panorama, from palm grove to the Todra gorges, in the middle of the High Atlas. Be ready for a sensational experience at the door of the desert !",
        "Oujda-Saïdia": "Saidia symbolizes Morocco of blue and warm waters. Either it's for holidays with family or in a couple, or with your friends, don’t miss out the opportunity to admire the splendid nature of the region. Go for a stroll in the city, visit the architectural heritage and long-standing medina in Oujda. With an impressive 14 kilometres of lovely white golden sandy beach and a generous sun shining all year round, The seaside resort of Saidia is an inevitable haven. At the water's edge or nearby, many activities are available to you including water sports and golfing. In the evening, the marina is the perfect spot to taste the delights of the region. Sixty km away from Saïdia, Oujda reveals the richness of its long history. From the medina and its monumental gates, to a cultural journey inside Sebti palace, to Lalla Aicha park which is a small haven of freshness inside the city. Oujda-Saïdia is all this : mindfulness, joy, and enough excitment to spend an unforgettable stay !",
        "Dakhla": "Located in the south of Morocco, Dakhla is a small part of paradise, lost between the waters of the Atlantic and the sands of the Sahara. It gives you a complete change of scenery. Kilometres of beaches expand from one side of the town to the other : an opportunity to relax, and indulge in all kinds of water activities. These shores are one of the most beautiful ones in Morocco. These pearls are an absolute haven of peace ; an ideal place to bask in the 25-degree sun all year round. In the surroundings, the PK25 and Foum El Bouir beaches are particularly famous. While PK25 is a perfect place for relaxation, where to swim quietly in the calm and crystalline waters of the lagoon, the atmosphere of Foum El Bouir is more lively. Being the perfect places for sliding sports : Surfers, kitesurfers and windsurfers, whether amateurs or professionals, meet here to experience thrilling challenges with waves and winds. « Pointe de Dragon » is another internationally renowned spot : waves are impressive and the most famous surfers have come in droves to these spectacular tubes that run for hundreds of metres. Leading to sub-Saharan Africa, Dakhla is a gateway to a never-ending array of thrilling and exciting activities !",
        "Safi": "The splendid architecture of Kechla and the waters of the Atlantic crashing against its walls: this is one of the many outstanding popular paintings in Safi. For five centuries now, the fortress has stood as a sentinel on the shores of the ocean. Its high crenellated towers offer admirable views of the surrounding area. It is an opportunity to admire the seafront, the bustling and animated life of this provincial capital. The pottery district is particularly attractive. Craftsmen make marvels of terracotta and clay that is put on display in the windows and stalls of their shops. Safi is one of the Moroccan capitals of ceramics and in its streets, beautiful trinkets are designed to make charming souvenirs. Atop the Kechla, admire the old Medina. The labyrinth of its alleys and their narrowness have something mysterious about them that invites you to take a stroll. A little far away, you’ll get to the Rue du Souk : you can hear echoes and smell the aromas. Behind you, you can hear the impressive rolling waves. All of Safi assets won it an internationally position as a renowned surfing spot. When you think that you’ve seen it all, Safi surprises you with its hidden treasures !",
        "Al Hoceima": "Blue waters of the Mediterranean, its gentle, light waves and the coastline that outlines the contours of one of Morocco's most beautiful bays, welcome to the wonderful Al Hoceima ! The place looks like an earthly paradise. On one of its many beaches, you can relax on a deckchair, enjoy the sun during a farniente stay. Al Hoceima is not only a simple seaside town. Its surroundings has a a lots of treasures that adventure lovers come in droves to explore. Outside the town, near the fishing village of Torres de Alcala, are the ruins of five watchtowers. The Portuguese had built them during their colony. Today, the site offers pleasant walks for all lovers of old stones ! Inside of the city, the port is not to be overlooked. Its edges are animated by the activity of fishermen and it is lovely to stroll there. A little far away, the Moro Viejo cornice offers a magnificent sight, and its bay gives a breathtaking view of the surroundings.",
        "Agadir-Taghazout": "In the west of the country, bordered by the waves of the Atlantic, Agadir is one of the pearls of Morocco. Whatever the season, the sun pours its rays and the city enjoys a pleasant climate that the trade winds still soften. Above all, its 10-kilometre-long seafront offers tourists magnificent views of the blue ocean and the opportunity to laze around in the best conditions. The main seaside resort of the country, the city with 300 days of sunshine per year, is full of activities. At the water's edge, cafés and restaurants open their doors to you, introduce you to the local gastronomy and submit their specialities to the enlightened judgements of your taste buds! Further on in the city, the El Had souk spreads out through the streets, deploys its stalls: more than 6,000 shops offer themselves to your curiosity and you will enjoy strolling in this atmosphere animated by the negotiations of the merchants. Never sleepy, the city welcomes every summer the Timitar festival dedicated to world music and more specifically to Amazigh music. Open to the ocean and the world, Agadir is an active city where it is good to relax.",
        "Tetouan": "Just like its first cousin, Tangier, Tetouan boasts a peaceful atmosphere. Known as the daughter of \"Granada\", it’s a city with Hispano-Moorish footmarks. Its medina is listed as a World Heritage Site by UNESCO. Not far from Tetouan, the seaside resort of \"Tamouda Bay\" expands on fifteen kilometres of fine sandy bay. Prestigious establishments have settled there, giving a luxury setting to the region. In the cristal-clear blue waters of the Mediterranean, you can onlye enjoy a peaceful stay while getting to know the art of living of the inhabitants. The city of Tetouan, with its multicultural identity, offers a journey through time !",
        "Tangier": "In the north of Morocco, on the coasts of Tangier where the Mediterranean and Atlantic waters converge, you’ll discover a unique city bearing a multicultural heritage. Stroll the streets of « the White »Tangier, they are lined with lime-coated houses. Just like Delacroix or Matisse did their upon arrival, let yourself be carried away by the dreamy atmosphere that covers the city. At the foot of the high walls of the \"Kasbah\", roam through the alleys of the great \"Socco\", and admire the fortress that dominates the medina. A little far away, explore the \"Sultan's Palace\" which is nowaydays dedicated to the arts of Morocco. Tangier is alsos renowned for the Spanish influence on its culture, starting with the arena that stands on the \"Plaza de Torros\", not to mention the \"Cervantes\" theatre built in 1913.",
        "Essaouira-Mogador": "Crenellated walls, special wind, houses with white and blue facades, Essaouira, the ancient Mogador is the \"Bride of the Atlantic\". It is one of those coastal cities where the unique atmosphere and water activities seamlessly blend. Walk quietly in the shade of its ramparts, the very ones that draw the contours of Astapor, the red city of the \"Game of Thrones\" series. Climb these walls and take the parapet walk, from where you can see the Purpuraires Islands, falcons, gulls and seagulls hovering above this nature reserve. On the other side, surfers, windsurfers and kitesurfers are taming the waves, taking advantage from the wind. A walk can lead you to the fishing port where the sailors are active. Get to the fish market where to taste the fish and seafood caught during the night. In the centre of the city, the medina invites you on a discovery wander into its winding alley. Ranked as the most beautiful cities in Morocco by Unesco, the city hums to the beat of music every summer : the Gnaoua festival celebrates Afro-Maghrebin rhythms making people’s stays memorable ones. For several years now, Morocco has adopted a responsible tourism ; the eco-resort Mogador, which is an unmissable place to have peaceful moments, as well as the beaches of the surroundings labeled Blue Flag, are living proofs to this ambition. Spend some time there, find complete mindfullness and serenety, in this enchanting destination that makes all your dreams come true !",
        "El Jadida-Mazagan": "Once nicknamed Mazagan, this city built by the Portuguese has stood proudly since the 16th century. Its well preserved architectural treasures and the subtle mixture of both Moroccan and European cultures have earned it a place on the UNESCO World Heritage List. By visiting the mysterious cistern and its majestic vaults, cinema lovers will recognize some of the decorations used by Orson Wells in \"Othello\". Multiple cinematographic and televisual productions come in droves each year to benefit from El Jadida assets. Between a green eucalyptus forest and the splendid beach of El Haouzia, the Kerzner International group known for establishing the Atlantis complex in Dubai, was also inspired enough to create the sumptuous seaside resort of Mazagan. While enjoying its beaches, modern golf courses and the festive atmosphere of its seaside resort, El Jadida invites you to discover ancestral traditions during the moussem of Moulay-Abdallah Amghar, where you’ll witness a stunning falcon training show, as well as other epic activities such as the Fantazia. El Jadida-Mazagan, is an unmissable place with a stunning seaside resort that will give a wishful taste of comeback !",
        "Casablanca": "Beautiful palm trees lining its paths, with the Atlantic ocean over the horizon, and large business buildings in every corner : Casablanca is the economic lung of Morocco ; a bustling metropolis. Modern infrastructures are in the middle of charming districts, between Arab-Muslim heritage and legacies of the colonial period. Discover all the possibilities : take a stroll in the medina, which is one of latest medinas built in Morocco, roam through the centre and its art-deco buildings, and join the Hassan II mosque ; the splendid of architecture built on the water. Let yourself be tempted by the festive side of the city. Take advantage of the cornice, its clubs and festivals too, such as the Casablanca Festival, Jazzablanca or Tremplin L'Boulevard. The coastline, bordered by beaches equipped to suit all your comfort, invites you to experience the most fun activities that will make your stay more enjoyable, from diving, to jet-skiing to boating. The White city, Casablanca, is where culture and serenity activities blend seamlessly.",
        "Meknes": "The Medina of Meknes and the remains of the royal palace have earned it an undisputable place on the UNESCO World Heritage List. On El Hedime square, Bab Mansour, one of the masterpieces of Hispano-Moorish art, is the gateway to the medina. Don’t miss visiting the royal stables and granaries of Sultan Moulay Ismail. In the North of Meknes, stands the largest Roman archaeological site in Morocco, which is Volubilis. Triumphal arch, capitol, house of Bacchus, everything bears witness to the splendour of the city and to its economic and political weight. Being an imperial and eternal citiy, Meknes offers you the experience of a timeless stay full of heritage discovery.",
        "Rabat": "Rabat is a cultural city deep-rooted in history. Many masterpieces decorate its streets and squares. Visit the Kasbah des Oudayas which is a majestic and splendid architecture embellished by the surrounding gardens. Not far from the walls, stand the imposing walls of the Chellah ; a necropolis from the time of the Merinids. Crossing the walls is like entering another world ; walk among ancient vestiges, gardens and storks. Rabat is also a modern eco-responsible capital with its green spaces. Beautiful parks await you, such as the botanical test garden or the Exotic Gardens of Bouknadel which is a few kilometres from the city. Rabat boasts an outstanding coastline ; on the Atlantic Ocean shores, it has kilometres of well equipped beaches that lead to the neighbouring city of Casablanca. With its modern infrastructures and various festivals, Rabat is a living city. Airport, tram, shopping centres, cafés and restaurants, all the amenities are within your reach. Revel in bustling vibes of music that Rabat celebrates like no other city ; from Mawazine, to Jazz au Chellah and many others that fill the atmosphere with sounds and rhythms from all over the world ! Rabat is a city where the treasures of the past blend with the most modern and environmentally friendly achievements.",
        "Fez": "Fez has a special atmosphere. This 13th-century city is an imperial city of long-lasting multicultural history, that reserves unexpected surprises for its visitors. Cross the walls of the famous medina of Fez, recognized by UNESCO as an outstanding universal value. Stroll through the streets of the Fez-El-Bali district. The Bab Boujloud is the easiest way to enter the medina. In early May, the squares and alleys resound with world music, where the Festival of World Sacred Music is held in the former imperial capital, which occurs along with Jazz in Riads, one of the main events in the city's cultural calendar. Don't leave without having tasted the city's gastronomy, reputed to be one of the best in the world.",
        "Marrakech": "Between tradition and modernity, Marrakech is the promise of unequalled sensations. Strolling the Jemaa El-Fna square and the souks with their shimmering colours and oriental smells, the red city offers you a complete change of scenery. Horse-drawn carriage rides, sunny terraces, travelling artists and other day and night activities will give a tates of wishful comeback. You will be able to admire all the architectural richness of the Medina, upon visiting one of its many riads, small oriental palaces overlooking a beautiful patio. You can also relax and recharge at the Menara, a vast garden with an emblematic basin. Marrakech shower its visitors by its splendour and its diversity, you just have to leave the ramparts to be immersed in modern Morocco. The districts of Gueliz and Hivernage offer the most modern infrastructures, luxury boutiques and international ready-to-wear stores, airy avenues ; which all contribute to Marrakech's unique offering. Being a growing economic bustling city, Marrakech has special festive and cultural places, such as the « Palais des Congres » and the splendid Royal Theater. Enjoy Marrakech at night by discovering the many themed venues, trendy clubs and traditional evenings that reflect the lively part of the city. In 2016, Marrakech will host the Cop22 to help adress climate change issues, as a recognition of its new international stature and its considerable reception capacity. "
    },
    "DiscoverMorocco": {
        "Idrisside dynasty": "The Idrisside dynasty was the first to conquer Morocco for more than a century. Its founder was Idriss the 1st famous for making Volubilis (Walili) his capital. From 789 to 978, the Idrisside dynasty dominated much of the Maghreb, including the North Africa of the current Morocco. Being the founder of the first royal dynasty in Morocco, the Idrissides were able to build new cities including Fez, which became afterwards the capital after Volubilis during the reign of the son Idriss II and his successors. Several monuments are evidence of the architectural and religious works of this dynasty, such as the Al-Qarawiyin Mosque, which is one of the most important mosques in Morocco and whose architecture is an outstanding artistic masterpiece. After several years of reign, the dynasty fell to the Almoravids.",
        "Almoravid Dynasty": "After the Idrissides, a new dynasty began reigning over the country and obtained shares of the Maghreb soil : the Almoravids. Destroying the African reign before attacking the north, the Almoravids founded Marrakech in 1062. They managed to reign over the whole Maghreb and Al-Andalus and named Marrakech as their capital. This unprecedented accomplishment was followed by the second imperial city which became the centre of trade and a bridge between sub-Saharan Africa and the Maghreb. Among the religious artefacts that has been built there, mosques such as the Koutoubia mosque, whose construction began during the Almoravid reign, Koranic medersas, ramparts and palaces. In addition, they also built an irrigation centre to provide water for the entire region.",
        "Almohad dynasty": "The Almohads won over the Almoravid dynasty in conquering Morocco. Guided at first by Îbn Toumert, the Almohads declared war against the Almoravids under religious pretext. Their Arabic name, implying the uniqueness \"Attawhid\", was the object of their proclamation. The architecture and culture - the two key pillars of this dynasty - are still embeded in the emblematic monuments of the city of Marrakech, the Almohad capital, through the redesign of the Koutoubia mosque, whose architecture is inspired from Giralda in Seville. The Almohad dynasty reigned thus for half a century and faded away following a defeat against the Christians in 1212.",
        "Marinid dynasty": "Founded by the Amazigh Chief Abou Yahia, with Fez as its capital, the Merinid dynasty overthrew the Almohads by driving them out of the Maghreb. Their reign didn’t last long, the Merinids were defeated by the Portuguese who attacked the coast through Ceuta and the Strait of Gilbraltar. Motivated by the transmission of religious values, the Merinids built several Zaouias, mosques and Koranic medersas such as the one in Salé. Several achievements and foundations symbolize this dynasty, the decorations in wood and stucco, roofs with glazed tiles, glazed ceramics, etc. The necropolis of Chellah, located in Rabat, contains vestiges that best represents the wealth of this dynasty in terms of culture, history, architecture and religious institutions.",
        "Saadian dynasty": "The Saadian dynasty had overthrown the Merinids and initially had Fez as its capital before winning Marrakech. They had declared war against the Portuguese and recovered several cities including the city of Agadir. The Saadians took Spain as their ally to protect themselves against Turkish threats. During the reign of the Saadians, Morocco experienced several years of glory which was demonstrated through culture, knowledge and wealth. The Saadians had endowed themselves with the gold of Sudan after defeating the African Empire of Songhai. They channelled their exploits by building several artistic artefacts. In Fez, they built the Borjs and gave a rejuvenation to the Al Qarawiyine mosque. In Marrakech, they built the tombs of the Saadians, the Ben Youssef medersa and the El Badiî Palace.",
        "Alaouite dynasty": "The Saadians were dethroned by the Alaouite dynasty. Originating from Tafilalt, the Alaouite dynasty drove out the Saadians for the sake of power. After taking Fez as a capital, itw as up to Meknes under the reign of Sultan Moulay Ismail, the finally to Rabat, which has been the current capital of Morocco since 1912. Thanks to this dynasty, the city of Fez was rejuvenates, embellishing the whole city and creating protective walls such as the famous Bab El-Mansour gate. The dynasty continued its reign until today. Muhammad VI is the twenty-third ruler of this succession, ensuring the unification of the Kingdom and the transmission of all religious values.",
        "Anti Atlas": "The Anti-Atlas, which is a chain recognized by its excessive aridity, hosts modest summits with Jbel Siroua (3 300 m) being the highest peak.Like the High Atlas and the Middle Atlas, all its massifs has an astonishing diversity  in terms of fauna and flora, geology and culture with Amazigh charm. Its arid character is due to its proximity to the Saharan lands since its last rampart is just before the \"Hamada du DraÃ¢\".Previously unknown, the crossing of the Anti-Atlas mountains represents today a modern circuit, rich in landscapes and leisure activities.",
        "The High Atlas": "The High Atlas, commonly known as the \"roof of Morocco\", is home to the highest peak in North Africa (Djbel Toubkal with 4,167 meters high).Stretching over 750 kilometres in length, the massifs of the High Atlas separate three parts of Morocco: Atlantic Morocco, Mediterranean Morocco and Saharan Morocco. With its Amazigh and Berber character, its inhabitants practise livestock farming and agriculture, which also represent the main economic pillars of the High Atlas.Apart from its tourist attractiveness, the High Atlas is known internationally not only for its national park for the preservation of natural biodiversity, but also for its archaeological sites.",
        "Moyen Atlas": "The Middle Atlas, which is touristic, offers a diversity of landscapes. Rich in fauna and flora, it presents a colourful picture of lakes, forests of holm oaks, cork oaks and deserted volcanic plateaus.Spread over 350 kilometres, the massifs of the Middle Atlas cover several regions of Morocco: Ifrane, Khenifra, Sefrou, Boulmane, Midelt, Hajeb, Taza and Beni-mellal.Moreover, these massifs belong to four water basins: the Sebou basin, the Bouregreg basin, the Oum Errabiaa basin and the Moulouya basin.The first three water basins flow into the Atlantic and the last one into the Mediterranean.",
        "The Atlantic Ocean": "The Atlantic Ocean stretches more than 3 000 km to the west of the kingdom, offering a living space to several cities on its coast.In the south of the Atlantic coast are Agadir, Tiznit, Dakhla and other cities, are rich in culture, history and leisure activities, due to their geographical advantage.Up to the north, you’ll come across the cities of Essaouira, El Jadida, Casablanca and Rabat which are just as famous as those in the south.An Atlantic coast, which consequently connects the Sahara to northwest Morocco, combines several cultures: traditional and modern; and offers a sweet spot forwater sportslovers from all over the world.",
        "The Mediterranean Sea": "The Mediterranean Sea stretches over 500 kilometres from the North-East to the North-West of Morocco.One of the most outstanding features of the country is the calm azure blue waters and fine golden sands, which attracts many Moroccan and foreign visitors every summer.From Tangier to the far east of Morocco, the sea breeze mixed with the Arab-Andalusian culture charms its visitors who are travelling far to stay in the most beautiful coasts of the world, to discover the hidden treasures of the wild beaches and to enjoy sunbathing on pebbled sands.",
        "Dakhla": "An absolute beauty to match every taste,Dakhlais a place for anyone wishing to indulge in the beauty of the sand dunes overlooking the Atlantic Ocean.Sunny all year round, there is nothing better than swimming in winter or autumn under a 25-degree sun or enjoying the leisure activities of its internationally renowned clubs.In Dakhla, PK25 and Foum El Bouir are the two famous beaches in the region. You can swim there, have fun, relax and enjoy all the activities of snow sports.",
        "Merzouga desert": "For a night under the stars or in a bivouac, for long hikes on the sand dunes and for a unique experience in the middle of the Moroccan desert, the Merzouga desert will shower you with its austere beauty.Merzouga is one of the doors that open to theSaharan vastness, with its ochre-brown colour, under a beautiful sunshine.At sunrise or sunset, you’ll enjoy a breathtaking landscape. In bivouac, you’ll enjoy all the folk festivities and the exceptional Saharan culture. On the back of a camel, admire all the wild landscapes."
    },
    "SuggestedTours": {
        "Discover Morocco by cruise": [
            "Take a seat on the boat and get started for an eye-opening experience. Head out tothe best stopover by the sea in Morocco, for an unforgettable stay.",
            "Let the cruise take you from the Atlantic coast, leaving the bride of the North, Tangier, towards the very wellknown seaside resort of Agadir.  Dont miss passing through Casablanca, the country's economic capital, but also Safi, the old portuguese city famous for its amazing pottery. Amusement, idleness, historical tours with cultural immersion, shopping… All you need for a sensational stay !",
            "Tick-off something from your bucket list with a breathtaking cruise trip as high as your expectations.",
            "With a mild climate in all seasons, and the surrounding picturesque natural environment, Morocco is unsurprisingly the best place to take a cruise from the main yachting ports, such as Tangier, Casablanca, Safi, and Agadir. Each stopover brings out a unique cultural immersion. Explore every single place while you’re in Morocco.",
            "While the city of Tangier will charm you by its cosmopilitan dimension, Safi is the relaxing but yet a dynamic city where you can admire every single detail. Casablanca coast is a great place to explore on foot and to take photos as night falls. Agadir and surrounding regions charm you with its stunning natural protected sites.",
            "Enjoy the best of the multifaced Morocco with some over-the-top adventures, along with the seasons!"
        ],
        "Uncover the untainted beauty of the Moroccan Desert": [
            "The south of Morocco is the gate that leads toSahara desert. In the middle of these stretches of sand, discover a world of dunes, sunshine and tranquility. Venture out there and experience the lifestyle of the nomadic tribes of the Sahara on your own.",
            "Marrakech and Agadir both lead to Sahara, and so is Fez. From the imperial city, cross the Talghemt pass. On the way to the desert, the land is covered with oases: it is the Tafilalet, a transitional region where the greens of the vegetation almost melt with the ochre of the sands. Following the trail of the old caravans, you reach Rissani, the cradle of the ancient Alaouite dynasty. You've juste arrived to the desert : dunes with their soft curves shaped by the Saharan wind \"The Chergui\".",
            "Go on an excursion riding a camel. Forget for a while the bustle of the cities and set up a bivouac in the middle of the sands in comfortable tents ! Join the majestic dunes of Merzouga: soak up in the magical atmosphere and indulge yourself with a sand bath in the middle of an eye-popping setting.Spend the night on the site: in the morning, the sun rises over the dunes forming a magical scene.",
            "When you think it's over, there are still many great spots to sit back and gaze: the dune of Tinfou, exceptional since it is far from the desert! The oasis of Erfoud also, and the mysterious Errachidia.",
            "On foot or on camelback, get ready to hike through the desert and disconnect yourself from everyday life !"
        ],
        "Travel back in time by visiting the imperial cities": [
            "For a special time in imperial cities, dive into the country's most important heritage sites and uncover the secrets of glorious dynasties ! Set out on a seven-day tour and let yourself be intrigued by the mysteries !",
            "The stages of this itinerary will introduce you to the four most historical and beautiful cities in Morocco. As soon as you arrive in Marrakesh, set out straightaway to explore the \"Red City\". You will visit its architectural treasures, including the Koutoubia mosque and Saadian tomb. A stop in the famous medina will expose you to the local customs and handiwork.",
            "Your next stop is Rabat, right in front of the Atlantic ocean. This place of hospitality invites you to stroll through its palm tree lined streets, and admire the thousand years old vestiges of both Mohamed V Mausoleum and Hassan Tower.",
            "Fez and Meknes will be your final station, on leaving Rabat. Both cities are famously picturesque and unique in their own ways. Fez is the cradle of spirituality with its mysterious and sensational medina,that is part of the World Heritage List. Meknes symbolizes the power of Sultan Moulay Ismail with an enchanting setting epitomized by the Bab-El-Mansour Gate.",
            "While you go through these four uniquely precious cities, be ready to open your arms to few surprises along the way. In the surrounding of Fez and Meknes, admire the imposing ruins of the Roman remains of volubilis, go through Ifrane, the « Little Switzerland », and explore what awaits you in Casablanca’s distinctive history, not far from Rabat and Marrakech.",
            "Morocco is a place packed with admiration and surprising discoveries, Set out for a week and enjoy every single moment in different places that await you with their rich heritage."
        ],
        "Explore the highlights of each city of the Great South": [
            "Do you dream of exploring as many landscapes as Morocco has to offer ? Ouarzazate, Zagora and Tinghir are the perfect place for departures in organized tours. In the company of a guide, explore the great south thanks to 4*4 or quad tours on the road of the 1000 Kasbahs or through the Dades or Draa valleys. Looking for thrills ?",
            "The Todra gorges or the dunes of Tinfou or Chgaga are also waiting for you there! In addition tothese unique landscapes, meet the local people and interact with them at each stage of your tour !",
            "Set out to conquer the Kasbah Road. Take a gaze at the palm groves and rose gardens with expansive views ! This road is home to a large number of typical citadels, a place that will show you with its natural beauty.",
            "For an immersive experience, you can even camp in a bivouac in the dunes.",
            "Don't forget to buy some typical souvenirs for you and your loved ones ! The locals will be delighted to exchange with you and share their daily life with you! Brace yourself for adrenaline-pumping in Ouarzazate !"
        ],
        "Discovering the fabulous valley of paradise": [
            "Let yourself be tempted by one of the most pleasant excursions in the heart of the Imouzzer mountain region of the Ida-Outanane. Located in the northern region a few kilometers from Agadir, the town of Imouzzer is famous for its honey and beautiful waterfalls.",
            "This famous beekeeping tour begins in the valley of paradise, which is the most appreciated oasis which is surrounded by mountains that delights nature lovers. The village of Imouzzer, with its white houses, is home to a beautiful palm grove surrounded by almond, olive and argan trees. The road runs along small terraced fields and undulating plateaus covered with fruit trees.",
            "In the surrounding area, enjoy a swim in the natural pools of the Asif Tamraght gorge, and discover the waterfalls of the Tinker wadi known for its waterfalls that flow in winter. Every year in May, the honey festival is held at Imouzzer des Ida-Outanane. A great opportunity to celebrate one of the flagship products of the region which is the pride of its inhabitants.",
            "Going up north, you arrive in Argana, then, a few kilometres further, in Izourki Oufella with its incomparable honey. This region is particularly famous for its refined honey with the flavours of thyme and lavender. This honey, mixed with crushed almonds and argan oil, gives rise to an artisanal mixture known as Amlou. This delicacy, equivalent to Nutella, is traditionally offered to newlyweds.",
            "The honey is collected in huge apiaries made of pisé, which is an uncooked earth used, among other things, to build kasbahs. Composed of more than 3000 beehives, the collective beehive of Inzerki, also called \"Taddart or Guerram\" is one of the oldest and largest rocks in the world. It constitutes a Berber historical heritage that has delighted the inhabitants of the region through the generations.",
            "Discover this sweet and fragrant tour, which starts in the Paradise Valley and goes through breathtaking landscapes, passing through aromatic trails and almond orchards. Take the honey route and experience a journey out of time. A circuit that will make you discover the know-how of passionate beekeepers, while having the opportunity to taste thevarious local productsderived from honey."
        ],
        "Explore the best of Morocco": [
            "Be ready for an exceptional great tour of Morocco ! During two weeks, you'll explore the most awe-inspiring aspects of Morocco. From North to South, choose your starting point and don't miss out any opportunity to discover all the treasures of the country.",
            "Nature, culture, sea, desert, and mountains, Morocco is a country of contrasts. Take the destination to Fez or Meknes. Two stopovers await you : Azilal and Beni Mellal with their Ouzoud waterfalls and the Bin El Ouidane lake, before ending up in Ifrane, famous for being the Little Switzerland of Morocco because of its architecture and its Cedar forest. Arrived in the two imperials, stroll the streets of the medina of Fez, cross the Bab Mansour gate of Meknes, and visit the famous ruins of Volubilis a few kilometers away.",
            "Next stopovers : the Mediterranean: the white Tangier, Tetouan known as the White dove and Chefchaouen which is a picturesque city all coloured and nestled between two mountains. Take the south path again. Rabat and its gardens offer a beautiful scenery : roam through the Kasbah des Oudayas or visit the centuries-old Hassan Tower. Next, weave your way to Casablanca, the bustling city, before you arrive to the charming El Jadida and Essaouira. With Agadir and its wonderful bay, the end of your journey approaches. Its hinterland is among the most beautiful ones of the Kingdom. In the East, explore the outstanding Ouarzazate and its famous kasbahs, and Merzouga which opens to the desert.",
            "Every single day of your journey reveals an entire surprise: gastronomic meals, local festivals, initiation toMoroccan craftsmanship, you'll explore all the customs and traditions of a country that never ceases to amaze you.",
            "The great tour of Morocco is a total immersion, a way to get to know Morocco from all its sides, those of its geography, itshistory, and its people."
        ]
    },
    "Blogs": 
        {
            "Tangier and Chefchaouen chosen for the shooting of the new Louis Vuitton":[
                "Morocco, is where iconic fashion designers names echo through the countryIn recent years, several international brands and most renowned ones, have been settled in Morocco. With modernity blending seamlessly with traditions, Morocco is a major player on the world stage of high fashion.Fashion weeks, fashion shows,art galleries, museumsand shootings, Many renowned artists, come in droves to Morocco to attend outstanding exhibitions and find inspiration.If you’re visiting Marrakech, make sure you visit the Majorelle's garden and the Yves Saint-laurent museum. Delve into the wonderful details and footprints of this legend. You’ll love the charm of his most beautiful creations.A first for Morocco, Chefchaouen and Tangier will host the Louis Vuitton shooting of the new spring-summer 2020 collectionSettled in both Marrakech and Casablanca, this French leather accessories brand has selectedTangierandChefchaouenfor the shooting of the new Spring-Summer collection. Located in the North of Morocco, these two pearls, attract thousands of visitors every year.Recognized as the most fashionable Moroccan tourist destinations, Chefchaouen and Tangier offer a wide range of picture perfect landscapes, and an outstanding culture.What other place could be better for Virgil Ablogh, Artistic Director of Louis Vuitton, to display his new collection, that illustrates an unparalleled vision : Reconstructing childhood memories that are both universal and timeless.From flower-picking holds, and kite games, to many other stunning creations, Virgil Ablogh has designed nature-inspired creations and souvenirs that bewitches every visitor.Let us take a look back at the Christian Dior fashion show !Christian Dior, the legendary fashion designer, has marked the year 2019 withhis fashion show \"Cruises 2020\" at the Palais el Badii in Marrakech. This fashion show symbolizes the strong belonging to Africa, with wax printed creations.A wonder that has often been admired on the internet !",
                "Morocco, is where iconic fashion designers names echo through the country",
                "In recent years, several international brands and most renowned ones, have been settled in Morocco. With modernity blending seamlessly with traditions, Morocco is a major player on the world stage of high fashion.",
                "Fashion weeks, fashion shows,art galleries, museumsand shootings, Many renowned artists, come in droves to Morocco to attend outstanding exhibitions and find inspiration.",
                "If you're visiting Marrakech, make sure you visit the Majorelle's garden and the Yves Saint-laurent museum. Delve into the wonderful details and footprints of this legend. You’ll love the charm of his most beautiful creations.",
                "",
                "A first for Morocco, Chefchaouen and Tangier will host the Louis Vuitton shooting of the new spring-summer 2020 collection",
                "Settled in both Marrakech and Casablanca, this French leather accessories brand has selectedTangierandChefchaouenfor the shooting of the new Spring-Summer collection. Located in the North of Morocco, these two pearls, attract thousands of visitors every year.",
                "Recognized as the most fashionable Moroccan tourist destinations, Chefchaouen and Tangier offer a wide range of picture perfect landscapes, and an outstanding culture.",
                "What other place could be better for Virgil Ablogh, Artistic Director of Louis Vuitton, to display his new collection, that illustrates an unparalleled vision : Reconstructing childhood memories that are both universal and timeless.",
                "From flower-picking holds, and kite games, to many other stunning creations, Virgil Ablogh has designed nature-inspired creations and souvenirs that bewitches every visitor.",
                "",
                "Let us take a look back at the Christian Dior fashion show !",
                "Christian Dior, the legendary fashion designer, has marked the year 2019 withhis fashion show \"Cruises 2020\" at the Palais el Badii in Marrakech. This fashion show symbolizes the strong belonging to Africa, with wax printed creations.",
                "A wonder that has often been admired on the internet !"],
            "Chefchaouen is considered to be the most instagrammable city in Morocco": [
                "A dream destinationHow can you not want to visit such a dreamy place with picturesque blue-coloured winding alleys on top of a small mountain ? And to enjoy its pure and fresh air, and admire the untainted beauty of its landscapes ?Located in the north-west of Morocco, up in the mountains of the Rif, this blue city attracts more and more Moroccan and foreign visitors from all over the world.Each house in the town, is home to deep-rooted and long-lasting stories, makingChefchaouena tourist town with irresistible charm and a picturesque scenery that will make you stay a memorable one.All you have to do, is pack your bags and book your flight without forgetting your camera !A city of international renownThe blue pearl of Morocco, with its undoubted assets, carves out a place for itself with the biggest tourist destinations in the world. In 2018, the city won the trophy for the best African intermediate city. In 2019, it ranks ninth for havingthe most beautiful streets and alleys in the world. This year, Chefchaouen being chosen for the shooting of the new Louis Vuitton spring-summer collection, is a crowning success of its efforts to preserve its heritage and nature.Experience a Chefchaouen tour on InstagramWith more than 620,000 posts on Instagam with the hashtag #Chefchouen,the latter is now the most insgrammable city in Morocco, according to the British newspaper Daily Mail. Being bewitched by its picturesque scenery, a lot of Influencers and bloggers come in droves to the city, and share their memories on this social network. How could it not be an excellent stay after all !",
                "A dream destination",
                "How can you not want to visit such a dreamy place with picturesque blue-coloured winding alleys on top of a small mountain ? And to enjoy its pure and fresh air, and admire the untainted beauty of its landscapes ?",
                "Located in the north-west of Morocco, up in the mountains of the Rif, this blue city attracts more and more Moroccan and foreign visitors from all over the world.",
                "Each house in the town, is home to deep-rooted and long-lasting stories, makingChefchaouena tourist town with irresistible charm and a picturesque scenery that will make you stay a memorable one.",
                "All you have to do, is pack your bags and book your flight without forgetting your camera !",
                "",
                "A city of international renown",
                "The blue pearl of Morocco, with its undoubted assets, carves out a place for itself with the biggest tourist destinations in the world. In 2018, the city won the trophy for the best African intermediate city. In 2019, it ranks ninth for havingthe most beautiful streets and alleys in the world. This year, Chefchaouen being chosen for the shooting of the new Louis Vuitton spring-summer collection, is a crowning success of its efforts to preserve its heritage and nature.",
                "",
                "Experience a Chefchaouen tour on Instagram",
                "With more than 620,000 posts on Instagam with the hashtag #Chefchouen,the latter is now the most insgrammable city in Morocco, according to the British newspaper Daily Mail. Being bewitched by its picturesque scenery, a lot of Influencers and bloggers come in droves to the city, and share their memories on this social network. How could it not be an excellent stay after all !",
                ""
            ]
        },
"SeeDo":{
    "Medina of Fez": "Fez El-Bali, the ancient city with a disctinct history, is a medina bubbling with bright colors, architecture and traditional craftsmanship. With its arabesque style and its historical drawings, Fez tells you the story of the early Moroccan dynasties footprints, leaving your own imagination run wild. Founded by the Idrissides, this medina is home not only to numerous palaces, but also to the oldest university in the world, Al-Quaraouiyine. Strolling through its streets is a chance to take advantage of the smallest architectural detail and handcrafted works of art, as well as an opportunity to immerse yourself in the depths of a city with an intellectual and spiritual character.",
    "Medina of Tetouan": "With a shape of a typical Kasbah, the medina of Tetouan, formerly called Titawin, has embraced Arab and Spanish while keeping the core aspects of its heritage and culture. Its intertwined alleyways hums to the rhythm of the exogenous Spanish traditions that have taken place. Let yourself dive into a sea air mixed with the songs of the birds, and taste the charm of its treasures as well as the particular selling atmosphere in its souks. The old medina also offers its visitors an ethnographic museum and an archaeological museum, which protect the most precious treasures of the city.",
    "Medina of Marrakech": "Just like the other medinas of Morocco, the World heritage medina of Marrakech, is the most historic and most visited district of the city. Beautifully surrounded by walls, forming several gateways, it is the beating heart of the \"ochre\" city. Not far from the entry, the charming Koutoubia mosque built under Almoravid dynasty’s reign, is located in the southwest medina of Marrakesh near the so called Jemaa el-Fna. Surrounded by gardens, this emblematic figure served as a model for the La Giralda mosque in Seville. As you stroll in its traditional quarters, you’ll find bazaars, traditional souks, museums, Riads, and café terraces that will make you enjoy its particular activities. All these places give access to the Jamaâ El Fna square, which is magically transformed into an open-air theatre as the night falls.",
    "Medina of Essaouira": "Endowed with a strong tourist potential, the medina of Essaouira is an excellent tourist destination. Recognized as a UNESCO World Heritage since 2001, Essaouira is a splendid city with historical streets and houses. Also known as the \"Mogador\", this mid-18th century fortified city is perfectly sealed and enclosed by a Vauban-style wall, with a kasbah that cannot be overlooked. A fresh breath with the Atlantic Breeze, and the beautiful sights of the city, offers its visitors a comfortable pace in its narrow streets, its romantic ramparts, its cultural wealth and its numerous art galleries. Go exploring the beautiful landscape with Portuguese drawings on the buildings, and taste the charm of the magnificent sights of La Skala. Don't forget to visit the port and the El Mellah district to immerse yourself in the history of this coastal city.",
    "Medina of Rabat": "Being the beating heart of Morocco's capital, the old medina will shower you with its charm. Embeded in the hustle and bustle of a modern city, its cultural aspect emerges from its narrow streets, fortified walls, Kasbah and souks. A culture that covers all the architectural details, the daily lives of the inhabitants and the arts and crafts. Soak up in the history of the Kasbah of the Oudayas, city of the Andalusians expelled from Spain by Philip III, with its bluish streets similar to those of Chefchaouen. Also visit its Souika street and its Souk Sebbate for a total immersion in traditional craftsmanship with the scent of leather. The « rue des Consuls » avenue shows a different setting: a marvelous painting of multicoloured carpets that symbolizes the city's wealth of craftsmanship. Don’t forget to visitthe ruins of Chellahbut also the Hassan tower.",
    "Internationally renowned films": "Inception (2010), Gladiator (2000), Babel (2006), The Last Temptation of Christ (1988) and The Man Who Knew Too Much (1995)... This is just a short selection of the films shot in Morocco. Martin Scorcese used the biblical settings of Morocco for his film The Last Temptation of Christ (1988). Morocco's landscapes were also a great asset to replicate ancient Rome in Ridley Scott's Gladiator (2000) and Egypt in Alain Chabat's Mission Cléopatre (2002). Kasbahs and desert landscapes were used to reproduce the imaginary kingdom of Westeros in the Game of Thrones series and will also be used for the new House of Dragon series, whose events take place 300 years before those of Game of Thrones.",
    "CLA Studios and Atlas Studio Corporation of Ouarzazate": "As you enter the Studio CLA in Ouarzazate, you'll instantly dive into the sets that have been used in the making of many films. Outside the site, you’ll witness a geuine reconstruction of Jerusalem in the Middle Ages. If you're staying in Ouarzazate, the Studio is a place you can’t afford to miss. As you leave Ouarzazate heading to Marrakech, the Atlas Studio offers a view that covers several sets from several films: Gladiator, Kundun, Asterix mission Cleopatra, Kingdom of Heaven, Ben-Hur...",
    "The Marrakech international film festival": "It is one of the most beautiful cinematographic and cultural events. It welcomes and pays tribute to personalities and actors who have succeeded in promoting cinema all over the world. Created in 2001 by His Majesty King Mohammed VI, the Marrakech International Film Festival is a real gathering as it offers uncensored films, masterclasses, tributes, but also the best of Moroccan cinema. Special attention is given to young talents, through the \"Cinécoles\" competition which rewards the best short films made by students.",
    "A vibrant culture": "If you want an immersive experience in both Moroccan culture and traditions, the medinas are the perfect choice. As you stroll the streets of each medina, observe the hidden details of Moroccan daily life. As a meditaranean country, Morocco is renowned for its friendly gatherings : from a refreshing tea ceremony to a delicious Couscous, the staple of solidarity, to a colourful folklore celebration, you’ll get back home with amazing memories to share.",
    "Parties and celebrations": "Several Moroccan events and celebrations take place in all Moroccan cities. These cultural and religious events that perfectly symbolize Moroccan traditions, are held during the famous Moussems and festivals.  Don't miss the Tan-Tan festival, which is particularly renowned and has been listed as part of the cultural and intangible heritage of humanity since 2008, the Cherry Festival in Sefrou, the Moussem of Roses in Kalâat M'gouna or the Gnaoua festival in Essaouira. Celebrate the Moroccan way !",
    "Gnaoua Music": "Gnaoua music takes us on a spiritual but also cultural journey.Being classified by UNESCO as World heritage since 2019, Gnawa music tells the story of slaves from sub-Saharan Africa. This ritual song with traditional music and dancing let you just go with the flow. The artists put on colourful costumes and sing to the beat of \"Lguembri\" and \"Qraqeb\", which are the two musical instruments of the Gnaouas. It’s not a surprise that great artists such as Led Zeppelin, Pat Metheny, Didier Lockwood or Marcus Miller have come to Morocco only to perform alongside the greatest musicians.",
    "Climbing Mount Toubkal": "Whether it's a solo or a group adventure, the hiking to Mount Toubkal is an extraordinary self-accomplishment, a physical-challeging achievement and an opportunity to soak up in the marvelous landscapes of the Atlas Mountains. Depending on the height of the summit, it takes two or three days trek. For thrill and adrenaline seekers, don’t wait any longer ! Prepare your trekking boots, sleeping bag, gloves and jackets, and set off on an unforgettable journey to the highest peak in North Africa. Adventures, landscapes, challenging obstacles... The circuit is beautifully animated ! Start from the village of Imlil and go exploring the rich culture of the village. When tiredness strikes, go to the mountain huts to spend the night in before continuing the next day to the summit. Once you reach the summit, you’ll be blown away with a panoramic view of gleaming clouds and by the quietness that leaves you with the wind noise.",
    "Trek at the happy valley Ait Bouguemez": "With its geographical diversity, Morocco has earned its international consideration thanks to its unique geographic features that never ceases to amaze its visitors. Many tourists go there to experience many outdoor activities : from mountain climbing, mountain biking, quad biking, horseback riding, to tree climbing... Escape the ordinary in scenic and gorgeous nature. Far from the beaches and coastal towns, deep in the mountains are hidden little treasures and unknown valleys. The Ait Bouguemez valley, know as the happy valley, is a perfect place for hiking. The valley will charm you with its expanses of high cultivated plateaus such as: Mgoun, Rat or the Azourki peak. Also get to know the local inhabitants who will shower you with their unparalleled hospitality.",
    "Skiing at Michlifen station": "At the Michlifen resort, get ready for winter sports ! 17 km far from the town of Ifrane, the Michlifen resort nestles in the mountains at an altitude of 2000 metres. The station being surrounded by cedar forests and covered with snow from mid-November, gives joy to the sport lovers. Whether you are an amateur or expert, 5 ski slopes are there for you to use and begin your snowy journey. In this ski resort, you can also go hiking or horseback riding. At the Michlifen place, an accrobranche circuit will take you on a journey of sensational discoveries. When you think it’s all over, there are still many other activities such as Mountain bikes and Montain Bikes.",
    "The Natural Park Souss Massa": "For a discovery tour and hiking while enjoying the picturesque landscapes, delve into to the Natural Park of Souss Massa in southern Morocco. Founded in 1991, the Natural Park of Souss Massa has the ultimate goal of restoring the Saharan fauna. It is a perfect destination for nature and landscape lovers. Home to more than 300 plant species and more than 300 animal species that let your imagination run wild. The natural park, in all its splendour, will amaze you with its richness and biodiversity that only exists in these places. Epic shows and exciting discoveries await for you in the park museum !",
    "Talassemtane National Park": "About ten kilometres from Chefchaouen, a peaceful land attracts both nature lovers and mountain sports enthusiasts. In the heart of the Rif mountains, the Talasemtane National Park is today a popular tourist destination thanks to its tours combining hiking, trekking and adventures. Spread over 60 thousand hectares, the are several picturesque reliefs : gorges, cliffs, caves and diverse vegetation ... Nothing is better than admiring breathtaking landscapes for a total escape from the ordinary world. For memorable evenings, spend a night beneath the stars !",
    "The lake of Lalla Takerkoust": "For a pure moment of happiness and tranquility, Lake Lalla Takerkoust offers you all the ingredients you need for a magical experience : soothing colours, breathtaking scenery in the fresh air. Located in the south of Marrakech, the Lalla Takerkoust dam is a perfect escape : you can walk around, rest, relax and enjoy several activities. During the day, you are given a wide choice of activities in the lake of Takerkoust. Jest ski and stand-up paddle games are for water sports enthusiasts, while horseback riding and quad biking are for hikers. Soak up in the tranquillity, enjoy a wonderful sunset and let yourself be blown away by the blazing colours of the sky around a lake with calm waters. Upon climbing the hill, you’ll admire the large breathtaking view over the weir.",
    "The Gorge of Tislit": "This modern hiking circuit, gives you an immersion in a spectacumar scenery and a dive into the deep-rooted Moroccan culture. Welcome to the Tislit Gorge ! About thirty kilometres from Taliouine, nature offers you enough eye candy to let your imagination run wild. At the entry to the gorges, the inhabitants of the town will shower you with a wide range of souvenirs: local products and Moroccan handicrafts. As you descend into the gorges while following the river bed, volcanic peaks gradually appear to form a wild, unique and resplendent scenery. Stroll the alleys of these gorges and indulge in the wild beauty of these magnificent landscapes. Go for a picnic and have a pure moment of joy !",
    "Akchur Waterfall": "Chefchouen being an award-winning tourist destination, the Akchour waterfall is not to be outdone. Akchour, the favorite spot for hikers, is full of heavenly landscapes, refreshing waterfalls and trickling water. Bring a camera and set out for the great experience ! After long hours of walking in the picturesque mountain forests, you’ll finally get to the waterfall. For years, climbing the mountains to reach the waterfalls has become a weekend ritual. Families and couples, young or old, go there to walk around and enjoy the coolness of the waterfalls: you can swim, have fun and even find young people singing songs from all over the world. Your journey to Chefchaouen can’t be complete without a stroll in Akchour !",
    "Lake Ifni": "Another must-to-visit when you're in Morocco, is the scenic Lake Ifni. At 2000 meters of altitude, at the very bottom of a valley, in the middle of the imposing mountains, you’ll find a paradisiacal place named « lake Ifni ». As impressive as the landscape of the surrounding mountains, a camping experience is just what you need for a moment of peacefulness. Mysterious, poetic and lyrical, it takes you on an adventure off the beaten track. If you are tempted by quiet places, with transparent waters and apocalyptic sunsets and sunrises: Lake Ifni is your dream destination. Exceed your limits, try the mountain climbing experience and enter into symbiosis with nature. Take the opportunity to swim and do some Standing Paddle !",
    "The exotic gardens of Rabat": "For some harking back to nature, and a getaway away from the hectic city centres, go to the exotic gardens of Bouknadel. Only twenty kilometres from the city of Rabat, these gardens will take you on a contemplative journey as you roam through the place. Peacefulness, bird songs, floral species, everything comes together to re-create a paradisiacal garden, where the rarest floral species are enchanted by the touch of the small rays of sunshine. Designed by Marcel François, this little paradise on earth offers an exotic scenery to its visitors, taking shape through a cave, the starting point, which later gives way to several brightly coloured gardens. It's an ingenious idea that traces the aspects of jungles and exotic forests, cracked by streams of water and arranged in several labyrinth-like alleys. A garden, an exotic journey that pulls you away from present moment, leaving you with the vegetation and the scenery.",
    "Jnan sbil Gardens": "Jnan Sbil or Paradise, these gardens are peaceful lands. They are the lungs of the city of Fez and the green capital of this imperial city. Although they have undergone a rejuvenation, the green parks symbolize Morocco's history and ancient architecture ; it was during the time of Prince Moulay Abdellah that this botanical garden was built to serve as a public park. The garden is divided into several spaces: each space takes you into its own universe, charms you with its own vegetation and seduces you with its unique beauty. If you are staying in Fez, a visit to the gardens is not to miss. You’ll have a pure moment of happiness and contemplation. There are 7 hectares of space where you can walk, stroll and rest amidst century-old trees of all kinds and fountains that give a breath of fresh air to the place.",
    "The Majorelle Garden": "Tourists from all over the world flock to this small peaceful land, located inside of the ochre city. A green and colourful scenery and lush vegetation rise in all shapes and forms around the Majorelle blue ornaments. The Majorelle garden of Marrakech is a masterpiece that highlights the Amazigh culture and modern art. Since its opening and thanks to the inspiration of Jacques Majorelle, the garden has been hosting several plants from different continents: bamboos, palms, cacti, flowering pots and plants. As you stroll through this poetic garden, a Moorish-style café-restaurant is as charming as its surroundings. At the back of the garden, an Amazigh museum is open to tourists who are instantly impressed by the rich culture of this people. People come to Marrakech to delve into in the beauty of the garden, but also to take beautiful and colourful photographs.",
    "The desert of Merzouga": "Peacefulness, and a complete change of scenery... the picture perfect Merzouga desert promise you the sun and the moon ! 5 km long dunes, traces of fennec paws, landscapes where silence echoes...Are you feeling it already ? The irresistible charm of Merzouga attracts more and more visitors from all over the world, tempted by the experience of the desert. Once you arrive to your destination, you get to admire the picturesque landscapes, with impressive geological forms: the Kasbah of Aït Benhaddou from the Dades Gorges to the Drâa Valley. The dunes of Merzouga, a living picture perfect postcard, offer you a plethora of activities to practice such as the popular sandbording or Amazigh Surfing! As high as waves, adrenaline rushes are guaranteed !",
    "The Desert of Zagora": "In couple or solo, the desert of Zagora is a must do & see in Morocco. Either you rent a 4x4 or a Buggy, the challenges are enormous and can cater to any of your desires. As you go through the arid desert, don't forget to stop and admire the historical sites, such as the Kasbah Aït Benhaddou. It’s impossible to remain unemotional to the charm of this outstanding set for several films. The fortresses and kasbhas of the Drâa valley never cease to amaze its visitors ; a thousand and one stories await you ! At the end of your journey, the city of Zagora will take you on a journey of sensations and tastes. Surrounded by its palm grove and overhung by a rocky massif. Soak up in the atmosphere of the scenery, take a camel ride and free your mind at sunset. Don't forget to sprinkle your late evening with a night beneath the stars !",
    "The Agafay Desert": "Only thirty minutes from Marrakech, aspire to freedom ! Drive through the Agafay desert to enjoy the endless  expanses of sand in a 4x4 or a Buggy. Indulge yourself in the surprising rocky dunes. Get off the beaten track and experience nights beneath the stars or in a bivouac. In the middle of the desert: a small splendid oasis awaits you. Being a small treasure nestled at the bottom of the desert, you’ll be amazed : plants, turtles, frogs... A break from the hustle and bustle is well deserved after a long journey ! Not to be outdone, the Amazigh villages offer you a scenic view whilst being immersed in the Amazigh culture. Get close to the villagers, refresh yourself with a tea and soak up in a pure moment of joy, following the beats of their traditional music.",
    "Horseback riding, a deep-rooted heritage": "The national stud farms of Marrakech, Meknes, Oujda, El Jadida and Bouznika, are a living proof of long-standing heritage of horseback riding in Morocco. Whether it’s for an exciting obstacle course or a quite ride along the beach, or along a scenic hinterland, enjoy the best of horseback riding in the land of sun.",
    "Cycling close to picture perfect nature": "Spinning your wheels in the city or in the Atlas Mountains, is just another thrilling activity you can have ! In Agadir and in Marrakech, there are routes in the middle of national parks surrounded by high mountains such as Talassemtane, where mountain bikers are brought together into challenges.",
    "A jump into the fantastic underworld": "Ready, set, go cave exploring. As you discover some of its magnetic caves, you’ll be impressed their magical architectures. The most popular one, the spectacular Hercules in Tangier, takes you into a legendary journey that let your imagination run wild. Kehf Tikhoubai, located in the Middle Atlas, is just another wonder not to miss : its galleries almost drowned in the bowels of the earth at a depth of nearly 310 metres.",
    "Sport fishing, a long-standing tradition": "Escape the hustle and bustle of the city, and explore the city's rivers. Fulfill your fishing fantasies on the best spots offered by Moroccan coasts ; the Atlantic Ocean and the Mediterranean. Agadir, Legzira, Essaouira, the bay of Dakhla or the shores of Sidi Ifni are some great spots to go deep-sea fishing.",
    "Thrills and adrenaline pumping with Rafting": "In the mountains, water provides the excitement and challenge of white water ! The Oued Ahansal offers you two days of thrillubg sports ; a 45 km downhill rafting, to reach the famous large lake of Bin el Ouidane, you won’t ask for more stimulating activity.",
    "Sun and surf in the magnetic Moroccan beaches": "In the west of the country, you'll be overwhelmed with the many options of sliding sports. Surfing, kite surfing wind surfing are one of the most popular activities you can enjoy on the beaches of Dakhla, Safi, Essaouira or Taghazout. The beauty of waves in the sunset ; you couldn’t ask for more ! Great surfers from all over the world, tick-off the Atlantic coast as an inevitable destination to challenge themselves and indulge in Surfing and Bodyboarding.",
    "Jet Ski, Kitesurfing and Windsurfing on the Atlantic and Mediterranean coasts": "In the north of the country, on the Mediterranean coast, enjoy the many activities offered to you. If you want to enjoy the calm waters of the Mediterranean seafront, indulge in the exhilarating moments of jet skiing, kitesurfing, sailing, windsurfing or water skiing. On the Atlantic coast, the attractive beaches of Essaouira, Agadir, Dakhla and Taghazout offer you its popular, jet skiing, and so many more thrills.",
    "When sport meets discovery: Dive and Fish!": "Nature exploring is also an option of your journey? Try our fishing or diving ! Upon arrival on the shore, many locals offer to take you on exhilarating excursions. As for scuba diving, the seabeds of the Mediterranean is ideal for water lovers. It invites you to explore its underwater reliefs composed of many eye-popping caves and atypical vegetation.",
    "The International Boat Show of Rabat": "Light sailing, surfing, body-boarding, light rowing, water-skiing... Endless water sports are available at the Rabat International Watersports show, which is held in partnership with the Rabat Yacht Club. This worldclass event is more than a competition ; being a meeting that gathers all amateurs and professionals of water sports frm all over the world. The city of Rabat offers you great opportunities to unleash your potential in water sports.",
    "The Traditional Hammam": "The typical wellness treatment has always been the traditional hammam. It's an inevitable ritual where scrubbing and soaping are mostly practiced using local products. Ghassoul, Henna, black soap, rose water, herbs, green clay and glove scrub Kessa or pancake, the traditional Hammam is an opportunity to deeply exfoliate the skin while providing a moment of relaxation and well-being.",
    "Spas": "From the traditional collective hammam to the SPA centre in luxury institutes in major Moroccan cities. Let yourself be tempted by a moment of intense relaxation. Selected as the \"Africa's Best Spa Destination\" in 2019, Morocco offers you a relaxing exceptional stay.",
    "Balneotherapy": "Marrakech, Agadir and Casablanca, are the perfect cities where you can have balneotherapy in the different fitness centres. Affusion showers, whirlpool baths and aquagym will give you a feeling of comfort and well-being. A wide range of treatments available are tailor-made for you to give you taste of a wishful come-back.",
    "Thalassotherapy": "Consisting of a combined use, under medical supervision and with a preventive and curative aim, of the benefits of the marine elements, the thalassotherapy is available in exceptional marine sites such as Agadir, Essaouira or Casablanca. You’ll find several types of treatments : relaxation, soothing, acupuncture, slimming or beautification.",
    "Thermal spas": "Near the city of Fez, and being famous for its naturally warm sulphurous water with many therapeutic properties, the Moulay Yacoub Spa adds a layer of wellbeing and peacefulness to its visitors. Bath, aerobath, jet shower, vaporium, thermal pool and massage, will all have curative and aesthetic immediate effects on you."
    },
    "accommodation": {
          "Guest houses": "In the medinas or surrounded by the beauty of nature, you'll experience well-being and a unique hospitality in the guest houses. Get immersed in the magnetic atmosphere during your stay, and get to know the Moroccan culture and traditions.",
          "Hotels & luxury Resorts": "Hotels have multiplied in the main cities in the past few years, including world-renowned hotel chains. The Mamounia was named the best hotel in the world and in Africa in 2018, then the 2nd best hotel in Africa after Le Royal Mansour in 2019.",
          "Riads": "The Riad, the epitome of Moroccan hospitality, offers an immersive experience in a long-standing cultural tradition that combines comfort, luxury, well-being, and service quality.",
          "Hostels and cottages": "Guest houses are scattered throughout medinas, while cottages and bivouacs are located in nature, providing an authentic Moroccan experience, especially in the countryside.",         
          "Campings": "If you leave the hustle and bustle of the city to experience a stay in a remote area at your own pace, campsites are tailor-made for you.",
          "Bivouacs": "For a complete break from routine in a calm area, bivouacs offer a fairy-tale experience surrounded by picturesque landscapes."
        
},
      "transportation":{
          "High-speed train": "The High-Speed Train (TGV) serves Tangier, Kenitra, Rabat, and Casablanca, making travel times much shorter.",
          "Train": "The Moroccan National Railways (ONCF) operates a large rail network connecting major cities like Marrakech and Oujda, except for Agadir, Nador, and some smaller cities.",
          "Coach tour": "Taking a coach is a fun way to travel around Morocco while enjoying the scenic views. Private companies offer comfortable rides to various destinations.",
          "Rental Cars": "Renting a car allows you to explore Morocco at your own pace. Many travel agencies offer a variety of rental options.",
          "Tramway": "The tramway is a preferred mode of transport in Rabat, Salé, and Casablanca, with ongoing expansion plans.",
          "Taxi": "Taxis are commonly used in Moroccan cities and are identified by color based on the city. On-demand taxi services are also available.",
          "Bus & Tourist train": "Sightseeing buses operate in Marrakech and Tangier, allowing for easy exploration. In cities like Agadir and Ifrane, small tourist trains are also available.",
          "Carriage ride": "For short trips, carriage rides allow visitors to explore medinas and souks more freely, soaking up the city’s atmosphere.",
          "Rental motorcycles & bicycles": "In Marrakech, bikes, scooters, and motorbikes are available for rent, offering a convenient way to explore the city’s hidden treasures.",
          "Taxi bikes": "Bike taxis provide an eco-friendly transport alternative, especially in Rabat, where tricycles navigate the narrow streets of the medina."
        },
      "food_drinks":{
          "Moroccan starters": "Moroccan starters accompany main dishes and vary by region. They include Moroccan salads, Briouates, Tektouta, and Zaâlouk, each with unique flavors.",
          "Tajine": "A popular Moroccan dish cooked in a traditional clay pot, Tajine includes various ingredients like meat, vegetables, nuts, and spices.",
          "Harira": "A traditional Moroccan soup made with pulses, tomatoes, pasta, and flour, typically consumed during Ramadan.",
          "Couscous": "A staple Moroccan dish made with semolina, served with meat, vegetables, fish, or sweets, often accompanied by a flavorful broth.",
          "Pastilla": "A delicate puff pastry filled with fish, chicken, pigeon, or almonds, balancing sweet and savory flavors.",
          "Méchoui": "A whole lamb or sheep roasted in a clay oven, originating from Turkish culinary traditions.",
          "Rfissa": "A dish from Casablanca made with msemmens, chicken, lentils, and spices, offering deep flavors and aromatic richness.",
          "Tanjia": "A signature dish of Marrakech, Tanjia is slow-cooked lamb or veal prepared in a terracotta jar.",
          "Bread": "Bread is a Moroccan staple, available in various types such as white, wholemeal, and sourdough, and served with traditional meals.",
          "Chebakia": "A popular Moroccan pastry served with soup or tea, traditionally prepared during Ramadan.",
          "Gazelle horns": "A famous Moroccan pastry made of crushed almonds wrapped in thin dough, scented with orange blossom.",
          "Ghriba": "A soft, crumbly cookie found in Moroccan and Maghreb cuisine, commonly available in pastry shops."
        },
      "Local_Transportation": {
        "Overview": "In Morocco, public transportation includes buses, trains, and the tram system in cities like Casablanca and Rabat. Trains connect major cities like Marrakesh, Fes, and Tangier, making it easy to travel between them. Buses are available for intercity travel, and taxis are common for local trips.",
        "Taxi_Services": "Taxi services are available in most Moroccan cities. Grand Taxis (shared taxis) can be used for intercity travel, while Petit Taxis (local taxis) are ideal for short trips within cities. Uber operates in cities like Casablanca and Marrakesh.",
        "Bike_Rentals": "Bike rentals are available in major cities such as Marrakesh and Casablanca. Several rental shops offer both regular and electric bikes. Scooter rentals are also popular for exploring cities.",
        "Traffic_Tips": "Traffic can be congested in major cities, particularly during rush hours (7:30-9 AM and 5-7 PM). It's advisable to use public transportation or taxis during these times. Google Maps and other local apps like 'CityMapper' provide real-time traffic information."
      },
      "Emergency_Contacts": {
        "Emergency_Numbers": {
          "Police": "19",
          "Ambulance": "15",
          "Fire_Department": "19"
        },
        "Embassy_Consulate": "The US Embassy is located in Rabat, at 2 Avenue Mohamed VI. For other countries, check the Moroccan Ministry of Foreign Affairs or your country's embassy website for the nearest consulate.",
        "Healthcare_Facilities": "Morocco has many private and public hospitals. Major cities like Casablanca, Marrakesh, and Rabat have healthcare facilities that are equipped with emergency services. Clinique Al Atlas and Hôpital Avicenne in Casablanca are highly recommended."
      },
      "Currency_and_Payment": {
        "Currency": "The official currency of Morocco is the Moroccan Dirham (MAD). Exchange rates fluctuate, so it's best to check rates before exchanging money.",
        "Money_Exchange": "Money exchange can be done at banks, exchange offices, and hotels. ATMs are available in major cities and tourist areas.",
        "Payment_Methods": "Credit cards (Visa, MasterCard) are widely accepted in cities, especially at hotels, restaurants, and shops. Mobile payment apps like PayPal and local apps like 'Wafa Cash' are also growing in use."
      },
      "Local_Etiquette_and_Customs": {
        "Cultural_Norms": "Moroccan culture is deeply rooted in Islam. Greetings often include a handshake or a slight bow. It’s polite to use 'Salam Alaikum' (Peace be upon you) when greeting someone. Tipping is appreciated (10-15% in restaurants). Dress modestly, especially in rural areas.",
        "Festivals_Holidays": "Key festivals include Eid al-Fitr, Eid al-Adha, and the Throne Day (July 30). The Fes Festival of World Sacred Music and the Marrakesh International Film Festival are also notable cultural events."
      },
      "Tourist_Attractions_and_Activities": {
        "Landmarks_Gems": "Must-see landmarks include the Hassan II Mosque in Casablanca, the Medina of Fes, the Majorelle Garden in Marrakesh, and the Atlas Mountains. The coastal city of Essaouira offers a mix of history and beach relaxation.",
        "Food_Dining": "Traditional Moroccan dishes include couscous, tajine, pastilla, and harira soup. Street food such as falafel, kebabs, and b'stilla (savory pastry) are common. Don’t miss out on mint tea, a symbol of Moroccan hospitality.",
        "Day_Trips_Hikes": "Consider a trip to the Sahara Desert for an unforgettable experience, or take a hike in the Atlas Mountains. Day trips to coastal cities like Essaouira or Agadir are also recommended."
      },
      "Safety_Tips": {
        "General_Safety": "Morocco is generally safe for tourists, but avoid walking alone in poorly lit areas, especially at night. Be cautious in crowded places to avoid pickpocketing.",
        "Tourist_Scams": "Common scams involve overpriced goods or services, such as guided tours or camel rides. Always agree on prices before accepting any service. Be cautious when offered unsolicited help.",
        "Personal_Belongings": "Keep your valuables in a secure place, especially in crowded areas like souks or on public transport. Use a money belt or secure bag when traveling around."
      },
      "Language": {
        "Key_Phrases": {
            "Hello": "Salam Alaikum",
            "Thank you": "Shukran",
            "How much is this?": "Beshhal hada?",
            "Where is the bathroom?": "Fin huwa l-hammam?",
            "Yes": "Iyyeh / ah / wah",
            "No": "Lla",
            "Please (addressing a singular)": "3afak",
            "I love you (addressing a singular)": "Kanbghik",
            "I miss you (addressing a singular)": "Twe77eshtek",
            "A lot": "Bezzaf",
            "A little": "Shwiya",
            "Okay": "Wakha",
            "Now": "Daba",
            "Not now": "Mashi daba",
            "Or": "Awla",
            "And": "W",
            "It's not a problem / It's okay": "Mashi moshkil",
            "(It was) not me": "Mashi ana",
            "I want…": "Bghit…",
            "I don't want...": "Ma bghitsh",
            "I am done / I finished": "Salit",
            "I am not done / I did not finish": "Ma salitsh",
            "Beautiful (masculine, singular)": "Zwin",
            "Bad/ugly (masculine, singular)": "Khayb",
            "Good (masculine, singular)": "Mezyan",
            "Excuse me (male)": "Sme7 lia",
            "Excuse me (female)": "Sem7i lia",
            "I don't speak Arabic": "Ma kanhdersh l3erbia",
            "I don't understand/I didn't understand": "Ma fhemtsh",
            "Do you understand me? (Addressing a singular)": "Fhemtini?",
            "I don't have any money": "Ma 3endish leflouss",
            "Welcome": "Mer7ba",
            "Take (this) (male)": "Hak",
            "Take (this) (female)": "Haki",
            "Give me… (Addressing a singular)": "3tini…",
            "I know": "3reft",
            "I don't know": "Ma 3reftsh",
            "I forgot": "Nsit",
            "I have to go": "Khasni nemshi",
            "It's your turn (Addressing a singular)": "Noubtek",
            "It's my turn": "Noubti",
            "I am tired": "3yit",
            "Where is the W.C?": "Fin kayna twalit?",
            "Congratulations": "Mebrouk",
            "Can you help me? (male)": "Tqdr t3awenni?",
            "Can you help me? (female)": "Tqdri t3awenini?",
            "I am looking for…": "Kanqelleb 3la...",
            "I can't find/I didn't find": "Ma lqitsh...",
            "Agreed/Enough": "Safi",
            "Slowly": "Beshwia",
            "Faster": "Bezzerba",
            "Maybe": "Imken",
            "Of course": "Tab3an / Akid",
            "I have a problem.": "3endi moshkila",
            "What do you think? (Addressing a singular)": "Ashno ban lik?",
            "What did you say? (Addressing a singular)": "Ashno guelti?"      
        },
        "Translation_Apps": "Google Translate is recommended for translating between Arabic, French, and English. Many locals also speak French, so it's helpful to learn a few basic phrases in French."
      },
      "Weather_and_Best_Time_to_Visit": {
        "Weather_Conditions": "Morocco experiences a diverse climate. The coast is mild, while the inland and desert regions can be very hot in summer (up to 40°C). Winter can be chilly, especially in the Atlas Mountains.",
        "Best_Time_to_Visit": "The best time to visit is during spring (March to May) and fall (September to November) when temperatures are pleasant. The summer months can be very hot, especially in the desert."
      },
      "Shopping_and_Souvenirs": {
        "Markets_Shopping": "Morocco's souks (markets) offer everything from handcrafted leather goods and carpets to spices and jewelry. Visit the Medina in Marrakesh or Fes for the most authentic shopping experiences.",
        "Souvenirs_Goods": "Look for unique items like Moroccan leather bags, handmade rugs, and Berber jewelry. Moroccan spices and argan oil also make great gifts."
      },
      "WiFi_and_Internet_Access": {
        "Public_WiFi": "Free Wi-Fi is available at cafes, hotels, and shopping malls in major cities. Some public places like parks or airports also provide free Wi-Fi.",
        "SIM_Internet_Options": "SIM cards for mobile data can be purchased at airports or local stores. Providers like Maroc Telecom and Inwi offer good coverage and competitive rates for tourists."
      },
      "Local_Laws_and_Regulations": {
        "Important_Laws": "Smoking is prohibited in indoor public places. Alcohol consumption is legal but should be done discreetly. Public displays of affection are not commonly accepted in rural areas.",
        "Tourist_Rules": "Tourists are required to carry a valid passport or a copy at all times. Be aware of local customs regulations, especially when traveling with items like alcohol or goods not for personal use."
    }
}